zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_SIUL2.h
  __I  uint8_t GPDI191;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15BC */
  __I  uint8_t GPDI190;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15BD */
  __I  uint8_t GPDI189;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15BE */
  __I  uint8_t GPDI188;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15BF */
  __I  uint8_t GPDI195;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C0 */
  __I  uint8_t GPDI194;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C1 */
  __I  uint8_t GPDI193;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C2 */
  __I  uint8_t GPDI192;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C3 */
  __I  uint8_t GPDI199;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C4 */
  __I  uint8_t GPDI198;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C5 */
  __I  uint8_t GPDI197;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C6 */
  __I  uint8_t GPDI196;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C7 */
  __I  uint8_t GPDI203;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C8 */
  __I  uint8_t GPDI202;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C9 */
  __I  uint8_t GPDI201;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15CA */
  __I  uint8_t GPDI200;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15CB */
  __I  uint8_t GPDI207;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15CC */
  __I  uint8_t GPDI206;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15CD */
  __I  uint8_t GPDI205;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15CE */
  __I  uint8_t GPDI204;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15CF */
  __I  uint8_t GPDI211;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D0 */
  __I  uint8_t GPDI210;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D1 */
  __I  uint8_t GPDI209;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D2 */
  __I  uint8_t GPDI208;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D3 */
  __I  uint8_t GPDI215;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D4 */
  __I  uint8_t GPDI214;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D5 */
  __I  uint8_t GPDI213;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D6 */
  __I  uint8_t GPDI212;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D7 */
  __I  uint8_t GPDI219;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D8 */
  __I  uint8_t GPDI218;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D9 */
  __I  uint8_t GPDI217;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15DA */
  __I  uint8_t GPDI216;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15DB */
  __I  uint8_t GPDI223;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15DC */
  __I  uint8_t GPDI222;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15DD */
  __I  uint8_t GPDI221;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15DE */
  __I  uint8_t GPDI220;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15DF */
  __I  uint8_t GPDI227;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15E0 */
  __I  uint8_t GPDI226;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15E1 */
  __I  uint8_t GPDI225;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15E2 */
  __I  uint8_t GPDI224;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15E3 */
  __I  uint8_t GPDI231;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15E4 */
  __I  uint8_t GPDI230;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15E5 */
  __I  uint8_t GPDI229;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15E6 */
  __I  uint8_t GPDI228;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15E7 */
  __I  uint8_t GPDI235;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15E8 */
  __I  uint8_t GPDI234;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15E9 */
  __I  uint8_t GPDI233;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15EA */
  __I  uint8_t GPDI232;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15EB */
  uint8_t RESERVED_17[3];
  __I  uint8_t GPDI236;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15EF */
  uint8_t RESERVED_18[272];
  __IO uint16_t PGPDO1;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1700 */
  __IO uint16_t PGPDO0;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1702 */
  __IO uint16_t PGPDO3;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1704 */
  __IO uint16_t PGPDO2;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1706 */
  __IO uint16_t PGPDO5;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1708 */
  __IO uint16_t PGPDO4;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x170A */
  __IO uint16_t PGPDO7;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x170C */
  __IO uint16_t PGPDO6;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x170E */
  __IO uint16_t PGPDO9;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1710 */
  __IO uint16_t PGPDO8;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1712 */
  __IO uint16_t PGPDO11;                           /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1714 */
  __IO uint16_t PGPDO10;                           /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1716 */
  __IO uint16_t PGPDO13;                           /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1718 */
  __IO uint16_t PGPDO12;                           /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x171A */
  uint8_t RESERVED_19[2];
  __IO uint16_t PGPDO14;                           /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x171E */
  uint8_t RESERVED_20[32];
  __I  uint16_t PGPDI1;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1740 */
  __I  uint16_t PGPDI0;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1742 */
  __I  uint16_t PGPDI3;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1744 */
  __I  uint16_t PGPDI2;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1746 */
  __I  uint16_t PGPDI5;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1748 */
  __I  uint16_t PGPDI4;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x174A */
  __I  uint16_t PGPDI7;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x174C */
  __I  uint16_t PGPDI6;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x174E */
  __I  uint16_t PGPDI9;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1750 */
  __I  uint16_t PGPDI8;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1752 */
  __I  uint16_t PGPDI11;                           /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1754 */
  __I  uint16_t PGPDI10;                           /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1756 */
  __I  uint16_t PGPDI13;                           /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1758 */
  __I  uint16_t PGPDI12;                           /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x175A */
  uint8_t RESERVED_21[2];
  __I  uint16_t PGPDI14;                           /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x175E */
  uint8_t RESERVED_22[32];
  __O  uint32_t MPGPDO[SIUL2_MPGPDO_COUNT];        /**< SIUL2 Masked Parallel GPIO Pad Data Out, array offset: 0x1780, array step: 0x4 */
} SIUL2_Type, *SIUL2_MemMapPtr;

