zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_SIUL2.h
#define SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_MASK    (0x100U)
#define SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_SHIFT   (8U)
#define SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_WIDTH   (1U)
#define SIUL2_MUX1_MISC_EN_LPUART0TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_MASK)

#define SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_MASK    (0x200U)
#define SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_SHIFT   (9U)
#define SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_WIDTH   (1U)
#define SIUL2_MUX1_MISC_EN_LPUART1TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_MASK)

#define SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_MASK    (0x400U)
#define SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_SHIFT   (10U)
#define SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_WIDTH   (1U)
#define SIUL2_MUX1_MISC_EN_LPUART2TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_MASK)

#define SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_MASK    (0x800U)
#define SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_SHIFT   (11U)
#define SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_WIDTH   (1U)
#define SIUL2_MUX1_MISC_EN_LPUART3TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUFIFO0DMA_EN_MASK  (0x10000U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO0DMA_EN_SHIFT (16U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO0DMA_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO0DMA_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUFIFO0DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUFIFO0DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUFIFO1DMA_EN_MASK  (0x20000U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO1DMA_EN_SHIFT (17U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO1DMA_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO1DMA_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUFIFO1DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUFIFO1DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUADC0DMA_EN_MASK   (0x40000U)
#define SIUL2_MUX1_MISC_EN_BCTUADC0DMA_EN_SHIFT  (18U)
#define SIUL2_MUX1_MISC_EN_BCTUADC0DMA_EN_WIDTH  (1U)
#define SIUL2_MUX1_MISC_EN_BCTUADC0DMA_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUADC0DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUADC0DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUADC1DMA_EN_MASK   (0x80000U)
#define SIUL2_MUX1_MISC_EN_BCTUADC1DMA_EN_SHIFT  (19U)
#define SIUL2_MUX1_MISC_EN_BCTUADC1DMA_EN_WIDTH  (1U)
#define SIUL2_MUX1_MISC_EN_BCTUADC1DMA_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUADC1DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUADC1DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUADC2DMA_EN_MASK   (0x100000U)
#define SIUL2_MUX1_MISC_EN_BCTUADC2DMA_EN_SHIFT  (20U)
#define SIUL2_MUX1_MISC_EN_BCTUADC2DMA_EN_WIDTH  (1U)
#define SIUL2_MUX1_MISC_EN_BCTUADC2DMA_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUADC2DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUADC2DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUFIFO0INT_EN_MASK  (0x200000U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO0INT_EN_SHIFT (21U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO0INT_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO0INT_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUFIFO0INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUFIFO0INT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUFIFO1INT_EN_MASK  (0x400000U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO1INT_EN_SHIFT (22U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO1INT_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO1INT_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUFIFO1INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUFIFO1INT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTULISTINT_EN_MASK   (0x800000U)
#define SIUL2_MUX1_MISC_EN_BCTULISTINT_EN_SHIFT  (23U)
#define SIUL2_MUX1_MISC_EN_BCTULISTINT_EN_WIDTH  (1U)
#define SIUL2_MUX1_MISC_EN_BCTULISTINT_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTULISTINT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTULISTINT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUADC0INT_EN_MASK   (0x1000000U)
#define SIUL2_MUX1_MISC_EN_BCTUADC0INT_EN_SHIFT  (24U)
#define SIUL2_MUX1_MISC_EN_BCTUADC0INT_EN_WIDTH  (1U)
#define SIUL2_MUX1_MISC_EN_BCTUADC0INT_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUADC0INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUADC0INT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUADC1INT_EN_MASK   (0x2000000U)
#define SIUL2_MUX1_MISC_EN_BCTUADC1INT_EN_SHIFT  (25U)
#define SIUL2_MUX1_MISC_EN_BCTUADC1INT_EN_WIDTH  (1U)
#define SIUL2_MUX1_MISC_EN_BCTUADC1INT_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUADC1INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUADC1INT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUADC2INT_EN_MASK   (0x4000000U)
#define SIUL2_MUX1_MISC_EN_BCTUADC2INT_EN_SHIFT  (26U)
#define SIUL2_MUX1_MISC_EN_BCTUADC2INT_EN_WIDTH  (1U)
#define SIUL2_MUX1_MISC_EN_BCTUADC2INT_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUADC2INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUADC2INT_EN_MASK)
/*! @} */

/*! @name MUX2_EMIOS_EN - MUX2 EMIOS ENABLE */
/*! @{ */

#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG16_EN_MASK   (0x1U)
#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG16_EN_SHIFT  (0U)
#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG16_EN_WIDTH  (1U)
#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG16_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_EMIOS_EN_EMIOSFLG16_EN_SHIFT)) & SIUL2_MUX2_EMIOS_EN_EMIOSFLG16_EN_MASK)

#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG17_EN_MASK   (0x2U)
#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG17_EN_SHIFT  (1U)
#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG17_EN_WIDTH  (1U)
#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG17_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_EMIOS_EN_EMIOSFLG17_EN_SHIFT)) & SIUL2_MUX2_EMIOS_EN_EMIOSFLG17_EN_MASK)

#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG18_EN_MASK   (0x4U)
#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG18_EN_SHIFT  (2U)
#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG18_EN_WIDTH  (1U)
#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG18_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_EMIOS_EN_EMIOSFLG18_EN_SHIFT)) & SIUL2_MUX2_EMIOS_EN_EMIOSFLG18_EN_MASK)

#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG19_EN_MASK   (0x8U)
#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG19_EN_SHIFT  (3U)
#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG19_EN_WIDTH  (1U)
#define SIUL2_MUX2_EMIOS_EN_EMIOSFLG19_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_EMIOS_EN_EMIOSFLG19_EN_SHIFT)) & SIUL2_MUX2_EMIOS_EN_EMIOSFLG19_EN_MASK)

