zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_SIUL2.h
#define SIUL2_GPDO212_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO212_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO212_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO212_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO212_PDO_n_SHIFT)) & SIUL2_GPDO212_PDO_n_MASK)
/*! @} */

/*! @name GPDO219 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO219_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO219_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO219_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO219_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO219_PDO_n_SHIFT)) & SIUL2_GPDO219_PDO_n_MASK)
/*! @} */

/*! @name GPDO218 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO218_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO218_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO218_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO218_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO218_PDO_n_SHIFT)) & SIUL2_GPDO218_PDO_n_MASK)
/*! @} */

/*! @name GPDO217 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO217_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO217_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO217_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO217_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO217_PDO_n_SHIFT)) & SIUL2_GPDO217_PDO_n_MASK)
/*! @} */

/*! @name GPDO216 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO216_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO216_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO216_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO216_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO216_PDO_n_SHIFT)) & SIUL2_GPDO216_PDO_n_MASK)
/*! @} */

/*! @name GPDO223 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO223_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO223_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO223_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO223_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO223_PDO_n_SHIFT)) & SIUL2_GPDO223_PDO_n_MASK)
/*! @} */

/*! @name GPDO222 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO222_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO222_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO222_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO222_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO222_PDO_n_SHIFT)) & SIUL2_GPDO222_PDO_n_MASK)
/*! @} */

/*! @name GPDO221 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO221_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO221_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO221_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO221_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO221_PDO_n_SHIFT)) & SIUL2_GPDO221_PDO_n_MASK)
/*! @} */

/*! @name GPDO220 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO220_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO220_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO220_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO220_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO220_PDO_n_SHIFT)) & SIUL2_GPDO220_PDO_n_MASK)
/*! @} */

/*! @name GPDO227 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO227_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO227_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO227_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO227_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO227_PDO_n_SHIFT)) & SIUL2_GPDO227_PDO_n_MASK)
/*! @} */

/*! @name GPDO226 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO226_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO226_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO226_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO226_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO226_PDO_n_SHIFT)) & SIUL2_GPDO226_PDO_n_MASK)
/*! @} */

/*! @name GPDO225 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO225_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO225_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO225_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO225_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO225_PDO_n_SHIFT)) & SIUL2_GPDO225_PDO_n_MASK)
/*! @} */

/*! @name GPDO224 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO224_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO224_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO224_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO224_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO224_PDO_n_SHIFT)) & SIUL2_GPDO224_PDO_n_MASK)
/*! @} */

/*! @name GPDO231 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO231_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO231_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO231_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO231_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO231_PDO_n_SHIFT)) & SIUL2_GPDO231_PDO_n_MASK)
/*! @} */

/*! @name GPDO230 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO230_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO230_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO230_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO230_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO230_PDO_n_SHIFT)) & SIUL2_GPDO230_PDO_n_MASK)
/*! @} */

/*! @name GPDO229 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO229_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO229_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO229_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO229_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO229_PDO_n_SHIFT)) & SIUL2_GPDO229_PDO_n_MASK)
/*! @} */

/*! @name GPDO228 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO228_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO228_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO228_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO228_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO228_PDO_n_SHIFT)) & SIUL2_GPDO228_PDO_n_MASK)
/*! @} */

