zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_SIUL2.h
#define SIUL2_GPDI161_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI161_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI161_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI161_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI161_PDI_n_SHIFT)) & SIUL2_GPDI161_PDI_n_MASK)
/*! @} */

/*! @name GPDI160 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI160_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI160_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI160_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI160_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI160_PDI_n_SHIFT)) & SIUL2_GPDI160_PDI_n_MASK)
/*! @} */

/*! @name GPDI167 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI167_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI167_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI167_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI167_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI167_PDI_n_SHIFT)) & SIUL2_GPDI167_PDI_n_MASK)
/*! @} */

/*! @name GPDI166 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI166_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI166_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI166_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI166_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI166_PDI_n_SHIFT)) & SIUL2_GPDI166_PDI_n_MASK)
/*! @} */

/*! @name GPDI165 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI165_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI165_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI165_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI165_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI165_PDI_n_SHIFT)) & SIUL2_GPDI165_PDI_n_MASK)
/*! @} */

/*! @name GPDI164 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI164_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI164_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI164_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI164_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI164_PDI_n_SHIFT)) & SIUL2_GPDI164_PDI_n_MASK)
/*! @} */

/*! @name GPDI171 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI171_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI171_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI171_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI171_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI171_PDI_n_SHIFT)) & SIUL2_GPDI171_PDI_n_MASK)
/*! @} */

/*! @name GPDI170 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI170_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI170_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI170_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI170_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI170_PDI_n_SHIFT)) & SIUL2_GPDI170_PDI_n_MASK)
/*! @} */

/*! @name GPDI169 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI169_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI169_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI169_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI169_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI169_PDI_n_SHIFT)) & SIUL2_GPDI169_PDI_n_MASK)
/*! @} */

/*! @name GPDI168 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI168_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI168_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI168_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI168_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI168_PDI_n_SHIFT)) & SIUL2_GPDI168_PDI_n_MASK)
/*! @} */

/*! @name GPDI175 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI175_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI175_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI175_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI175_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI175_PDI_n_SHIFT)) & SIUL2_GPDI175_PDI_n_MASK)
/*! @} */

/*! @name GPDI174 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI174_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI174_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI174_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI174_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI174_PDI_n_SHIFT)) & SIUL2_GPDI174_PDI_n_MASK)
/*! @} */

/*! @name GPDI173 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI173_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI173_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI173_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI173_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI173_PDI_n_SHIFT)) & SIUL2_GPDI173_PDI_n_MASK)
/*! @} */

/*! @name GPDI172 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI172_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI172_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI172_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI172_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI172_PDI_n_SHIFT)) & SIUL2_GPDI172_PDI_n_MASK)
/*! @} */

/*! @name GPDI179 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI179_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI179_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI179_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI179_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI179_PDI_n_SHIFT)) & SIUL2_GPDI179_PDI_n_MASK)
/*! @} */

/*! @name GPDI178 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI178_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI178_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI178_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI178_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI178_PDI_n_SHIFT)) & SIUL2_GPDI178_PDI_n_MASK)
/*! @} */

/*! @name GPDI177 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI177_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI177_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI177_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI177_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI177_PDI_n_SHIFT)) & SIUL2_GPDI177_PDI_n_MASK)
/*! @} */

